//============================================================
// Модуль: tick_generator
// Назначение: Формирование периодического импульса заданной частоты.
//
// Использование: Для тактовой частоты FPGA 100 МГц формирует импульс
//   длительностью один такт каждые 1 секунду.
//
// * Важно: Модуль только формирует входной ипульс, 
// он НЕ управляет состоянием таймера.
//============================================================
module tick_generator
#(
    parameter CLK_FREQ = 100_000_000, // частота входного синхросигнала, Гц
    parameter TICK_FREQ = 1 // частота выходных импульсов, Гц
)
// описание портов модуля
(
    input wire clk, // Тактовый сигнал FPGA. Например: 100 MHz для Basys3
    input wire rst, // Сброс системы

    output reg tick // Выходной импульс
);

localparam integer CNT_MAX = // максимальное значение внутреннего счетчика
        CLK_FREQ / TICK_FREQ - 1;

// Определение необходимой разрядности счетчика
localparam integer CNT_WIDTH =
        $clog2(CNT_MAX + 1);

reg [CNT_WIDTH-1:0] counter;

// Описание работы 

always @(posedge clk)
begin
    if (rst)
    begin
        counter <= 0;
        tick <= 1'b0;
    end

    else
    begin

        //----------------------------------------------------
        // Достигнут период формирования импульса
        //----------------------------------------------------
        if (counter == CNT_MAX)
        begin
            counter <= 0;
            // Импульс длительностью один такт clk
            tick <= 1'b1;
        end

        else
        begin
            counter <= counter + 1'b1;
            tick <= 1'b0;
        end
    end
end

endmodule
