//============================================================
// Модуль: main_1_initial
//
// Назначение: Верхний уровень первого этапа проекта таймера.
//
//   Модуль объединяет:
//   1. tick_generator - Формирует секундный тактовый импульс.
//   2. bcd_counter - Хранит текущее время, загружает начальное значение
//      и выполняет обратный отсчет.
// Важно:
//   main_1 не содержит алгоритмов управления таймером.
//   Управляющие сигналы load и enable являются внешними входами. 
//
// Формат времени:  min_t min_u sec_t sec_u
// Например:  1 2 3 4
//============================================================


module main_1_initial
#(
    parameter CLK_FREQ = 100_000_000
//    parameter CLK_FREQ = 10
)
(
    //--------------------------------------------------------
    // Тактовые и управляющие входы
    //--------------------------------------------------------
    input wire clk, // Тактовый сигнал FPGA. Например: 100 MHz для Basys3.
    input wire rst, // Сброс системы.
    input wire load, // Разрешение загрузки начального времени.
    input wire enable, // Разрешение обратного отсчета.

    //--------------------------------------------------------
    // Начальное значение таймера
    //--------------------------------------------------------
    input wire [3:0] load_sec_u, // Единицы секунд
    input wire [3:0] load_sec_t, // Десятки секунд
    input wire [3:0] load_min_u, // Единицы минут
    input wire [3:0] load_min_t, // Десятки минут

    //--------------------------------------------------------
    // Текущее значение времени
    //--------------------------------------------------------
    output wire [3:0] sec_u, // Текущие единицы секунд
    output wire [3:0] sec_t, // Текущие десятки секунд
    output wire [3:0] min_u, // Текущие единицы минут
    output wire [3:0] min_t, // Текущие десятки минут

    //--------------------------------------------------------
    // Признак окончания счета
    //--------------------------------------------------------
    output wire zero

);

    //--------------------------------------------------------
    // Внутренний сигнал секундного импульса
    //--------------------------------------------------------
    wire tick_1s;

    //--------------------------------------------------------
    // Генератор секундного импульса
    //--------------------------------------------------------
    tick_generator
    #(
        .CLK_FREQ(CLK_FREQ),
        .TICK_FREQ(1)
    )
    u_tick_generator
    (
        .clk(clk), // входной синхросигнал
        .rst(rst), // сброс

        .tick(tick_1s) // выходной импульс раз в секунду
    );

    //--------------------------------------------------------
    // Вычитающий счетчик секунд - собственно таймер
    //-------------------------------------------------------

    bcd_counter
    u_bcd_counter
    (
        .clk(clk), // входной синхросигнал
        .rst(rst), // сброс

        //-------------------------------
        // Управление
        //-------------------------------
        .enable(enable), // разрешение счета
        .tick(tick_1s),  // импульс
        .load(load),     // загрузка начального значения

        //-------------------------------
        // Начальное значение
        //-------------------------------
        .load_sec_u(load_sec_u), // Единицы секунд
        .load_sec_t(load_sec_t), // Десятки секунд
        .load_min_u(load_min_u), // Единицы минут
        .load_min_t(load_min_t), // Десятки минут


        //-------------------------------
        // Текущее время
        //-------------------------------
        .sec_u(sec_u), // Единицы секунд
        .sec_t(sec_t), // Десятки секунд
        .min_u(min_u), // Единицы минут
        .min_t(min_t), // Десятки минут


        //-------------------------------
        // Окончание счета
        //-------------------------------
        .zero(zero)
    );

endmodule