//============================================================
// Модуль: main_2_FSM
//
// Назначение:
//   Верхний уровень проекта таймера с управляющим FSM.
//
// Состав:
//   1. tick_generator - Формирование секундного импульса.
//   2. timer_fsm - Автомат, управляющий режимами работы.
//   3. bcd_counter  - вычитающий счетчик
//
// Алгоритм работы:
//
//   reset -> сброс, перезод в состояние загрузки
//   load -> загрузка времени
//   start -> RUN, счет
//   pause -> PAUSE, переход в состояние останова
//   zero -> FINISH, завершение счета
//============================================================

module main_2_FSM #( parameter CLK_FREQ = 100_000_000
)
(   // описание портов модуля
    //--------------------------------------------------------
    // Тактовые и управляющие входы
    //--------------------------------------------------------
    input wire clk,
    input wire reset,

    // Загрузка начального времени
    input wire load,

    // Запуск таймера
    input wire start,

    // Пауза/продолжение счета
    input wire pause,

    //--------------------------------------------------------
    // Начальное значение времени
    //--------------------------------------------------------
    input wire [3:0] load_sec_u,
    input wire [3:0] load_sec_t,
    input wire [3:0] load_min_u,
    input wire [3:0] load_min_t,

    //--------------------------------------------------------
    // Выходные данные таймера
    //--------------------------------------------------------
    output wire [3:0] sec_u,
    output wire [3:0] sec_t,
    output wire [3:0] min_u,
    output wire [3:0] min_t,

    //--------------------------------------------------------
    // Состояние таймера
    //--------------------------------------------------------
    output wire finish
);

    //--------------------------------------------------------
    // Внутренние сигналы
    //--------------------------------------------------------
    // секундный импульс
    wire tick_1s;

    // команды от FSM
    wire load_time_en; // разрешение загрузки начального значения
    wire count_enable; // разрешение счета

    // признак окончания счета
    wire zero;

    //--------------------------------------------------------
    // Инстанс генератора секундного импульса
    //--------------------------------------------------------
    tick_generator #(
        .CLK_FREQ(CLK_FREQ),
        .TICK_FREQ(1)
    )
    u_tick_generator
    (
        .clk(clk),
        .rst(reset),
        .tick(tick_1s)
    );

    //--------------------------------------------------------
    // Инстанс управляющего автомата
    //--------------------------------------------------------
    timer_fsm
    u_timer_fsm
    (
        .clk(clk),
        .reset(reset),
        .load(load),
        .start(start),
        .pause(pause),
        .zero(zero),
        .load_time_en(load_time_en),
        .count_enable(count_enable),
        .finish(finish)
    );

    //--------------------------------------------------------
    // Инстанс вычитающего счетчика
    //--------------------------------------------------------
    bcd_counter
    u_bcd_counter
    (
        .clk(clk),
        .rst(reset),
        //-------------------------------
        // Управление
        //-------------------------------
        .load(load_time_en),
        .enable(count_enable),
        .tick(tick_1s),

        //-------------------------------
        // Начальное значение
        //-------------------------------
        .load_sec_u(load_sec_u),
        .load_sec_t(load_sec_t),
        .load_min_u(load_min_u),
        .load_min_t(load_min_t),

        //-------------------------------
        // Текущее значение
        //-------------------------------
        .sec_u(sec_u),
        .sec_t(sec_t),
        .min_u(min_u),
        .min_t(min_t),

        //-------------------------------
        // Окончание счета
        //-------------------------------
        .zero(zero)
    );
endmodule
