//============================================================
// Модуль: clock_manager
// Назначение:  Управление тактовым сигналом проекта.
// Для платы Basys3:
//   вход: 100 MHz
//
//   выход: системный clock
//============================================================

module clock_manager
(
    input wire clk100,
    input wire reset,

    output wire clk_sys,

    output wire reset_sync
);

    //--------------------------------------------------------
    // В данном проекте частота не изменяется
    // Используется прямое подключение
    // входного генератора платы
    //--------------------------------------------------------
    assign clk_sys = clk100;

    //--------------------------------------------------------
    // Синхронизация reset
    // Два последовательных триггера
    //--------------------------------------------------------

    reg [1:0] rst_pipe;

    always @(posedge clk_sys)
    begin

        if(reset)
        begin

            rst_pipe <= 2'b11;

        end

        else
        begin

            rst_pipe[0] <= 1'b0;

            rst_pipe[1] <= rst_pipe[0];

        end
    end

    assign reset_sync = rst_pipe[1];

endmodule

