//============================================================
// Модуль: bcd_counter
//
// Назначение: Вычитающий счетчик импульсов.
// * Счетчик знает, что в минуте - 60 секунд :)
//
// Приоритет операций:
//   1. rst  - сброс;
//   2. load - загрузка начального времени;
//   3. enable & tick - уменьшение времени.
//
// Если enable=0, значение времени сохраняется.
//============================================================

module bcd_counter
(
    input wire clk, // синхросигнал
    input wire rst, // сброс
    input wire enable, // разрешение счета
    input wire tick, // входной импульс
    input wire load, // загрузка начального значения

    input wire [3:0] load_sec_u, // Единицы секунд
    input wire [3:0] load_sec_t, // Десятки секунд
    input wire [3:0] load_min_u, // Единицы минут
    input wire [3:0] load_min_t, // Десятки минут

    output reg [3:0] sec_u, // Текущие единицы секунд
    output reg [3:0] sec_t, // Текущие десятки секунд
    output reg [3:0] min_u, // Текущие единицы минут
    output reg [3:0] min_t, // Текущие десятки минут

    output wire zero
);


assign zero = // сигнал окончания счета
       (sec_u == 4'd0) &&
       (sec_t == 4'd0) &&
       (min_u == 4'd0) &&
       (min_t == 4'd0);

always @(posedge clk)
begin

    //--------------------------------------------------------
    // Сброс
    //--------------------------------------------------------
    if (rst)
    begin
        sec_u <= 0;
        sec_t <= 0;
        min_u <= 0;
        min_t <= 0;
    end

    //--------------------------------------------------------
    // Загрузка начального времени
    //--------------------------------------------------------
    else if (load)
    begin
        sec_u <= load_sec_u;
        sec_t <= load_sec_t;
        min_u <= load_min_u;
        min_t <= load_min_t;
    end

    //--------------------------------------------------------
    // Обратный отсчет
    //--------------------------------------------------------

    else if (enable && tick && !zero)
    begin
        //-------------------------------
        // Единицы секунд
        //-------------------------------
        if (sec_u != 0)
        begin
            sec_u <= sec_u - 1;
        end

        //-------------------------------
        // Заем от десятков секунд
        //-------------------------------
        else
        begin
            sec_u <= 9;

            if (sec_t != 0)
            begin
                sec_t <= sec_t - 1;
            end

            //---------------------------
            // Заем от минут
            //---------------------------
            else
            begin
                sec_t <= 5;

                if (min_u != 0)
                begin
                    min_u <= min_u - 1;
                end

                else
                begin
                    min_u <= 9;

                    if (min_t != 0)
                    begin
                        min_t <= min_t - 1;
                    end
                end
            end
        end
    end
end
endmodule