//============================================================
// Модуль: timer_fsm
//
// Назначение: Управляющий автомат таймера.
//
// Функции:
//   - управление загрузкой начального времени;
//   - запуск обратного отсчета;
//   - остановка и продолжение счета;
//   - фиксация окончания отсчета.
//
// Состояния автомата:
//
//   LOAD
//       Ожидание начального значения.
//       Разрешена загрузка времени.
//
//   RUN
//       Выполнение обратного отсчета.
//
//   PAUSE
//       Остановка счета с сохранением текущего значения.
//
//   FINISH
//       Время достигло значения 00:00.
//
// Управляющие выходы:
//
//   load_time_en
//       Разрешение загрузки времени в bcd_counter.
//
//   count_enable
//       Разрешение уменьшения времени.
//
//   finish
//       Признак завершения отсчета.
//============================================================


module timer_fsm
(
    input  wire clk, // Тактовый сигнал FPGA
    input  wire reset, // Сброс автомата.
    // По сигналу сброса из любого состояния переход в LOAD.

    input  wire load, // Команда загрузки начального времени, состояние не изменяется
    input  wire start,// Команда запуска таймера.
    input  wire pause, // Команда остановки/продолжения счета.
    input  wire zero,  // Сигнал окончания отсчета от bcd_counter.

    output reg load_time_en, // Разрешение загрузки времени.
    output reg count_enable, // Разрешение обратного отсчета.
    output reg finish // Признак состояния окончания счета
);

    //--------------------------------------------------------
    // Кодирование состояний
    //--------------------------------------------------------
    localparam STATE_LOAD   = 2'b00;
    localparam STATE_RUN    = 2'b01;
    localparam STATE_PAUSE  = 2'b10;
    localparam STATE_FINISH = 2'b11;

    //--------------------------------------------------------
    // Регистры текущего и следующего состояния
    //--------------------------------------------------------
    reg [1:0] state;
    reg [1:0] next_state;

    //--------------------------------------------------------
    // Комбинационная логика переходов
    //--------------------------------------------------------
    always @(*)
    begin
        // По умолчанию состояние сохраняется
        next_state = state;

        case(state)

            //------------------------------------------------
            // Начальное состояние - Состояние ожидания загрузки
            //------------------------------------------------
            STATE_LOAD:
            begin
                // Загрузка времени имеет приоритет.
                //
                // При load=1 автомат остается в LOAD.
                // bcd_counter получает разрешение записи.

                if(load)
                begin
                    next_state = STATE_LOAD;
                end

                // Запуск разрешен после загрузки.
                else if(start)
                begin
                    next_state = STATE_RUN;
                end

            end

            //------------------------------------------------
            // Состояние работы - обратного отсчета
            //------------------------------------------------
            STATE_RUN:
            begin
                // Проверка окончания времени
                // имеет максимальный приоритет.

                if(zero)
                begin
                    next_state = STATE_FINISH;
                end

                // Пауза - остановка счета.
                else if(pause)
                begin
                    next_state = STATE_PAUSE;
                end
            end

            //------------------------------------------------
            // Состояние паузы
            //------------------------------------------------
            STATE_PAUSE:
            begin
                // Повторное нажатие pause
                // продолжает счет.

                if(pause)
                begin
                    next_state = STATE_RUN;
                end
            end

            //------------------------------------------------
            // Завершение отсчета
            //------------------------------------------------
            STATE_FINISH:
            begin
		// После окончания отсчета остается в этом состоянии
                // Новый цикл начинается после сброса.
                if(reset)
                begin
                    next_state = STATE_LOAD;
                end
            end

            //------------------------------------------------
            // Защита от недопустимого состояния
            //------------------------------------------------
            default:
            begin
                next_state = STATE_LOAD;
            end
        endcase
    end



    //--------------------------------------------------------
    // Регистрация состояния
    //--------------------------------------------------------
    //
    // Синхронный сброс.
    //
    //--------------------------------------------------------
    always @(posedge clk)
    begin
        if(reset)
        begin
            state <= STATE_LOAD;
        end

        else
        begin
            state <= next_state;
        end

    end

    //--------------------------------------------------------
    // Формирование выходных сигналов
    // Автомат Мура:
    // выходы зависят только от текущего состояния.
    //--------------------------------------------------------

    always @(*)
    begin

        // Значения по умолчанию
        load_time_en = 1'b0;
        count_enable = 1'b0;
        finish       = 1'b0;

        case(state)

            //------------------------------------------------
            // Загрузка начального времени
            //------------------------------------------------
            STATE_LOAD:
            begin
                load_time_en = 1'b1;
            end

            //------------------------------------------------
            // Работа - обратный отсчет
            //------------------------------------------------
            STATE_RUN:
            begin
                count_enable = 1'b1;
            end

            //------------------------------------------------
            // Пауза
            //------------------------------------------------
            STATE_PAUSE:
            begin
                count_enable = 1'b0;
            end

            //------------------------------------------------
            // Завершение
            //------------------------------------------------
            STATE_FINISH:
            begin
                finish = 1'b1;
            end

            default:
            //------------------------------------------------
            // Недопустимое состояние - ТАК НАДО!!!
            //------------------------------------------------
            begin
                load_time_en = 1'b0;
                count_enable = 1'b0;
                finish       = 1'b0;
            end

        endcase

    end
endmodule


